import React from 'react'
import {useLocation} from 'react-router-dom'

import Styles from './styles/TournamentRules.module.css'

const AppendixRules = () => {
    const {index} = useLocation().state

    const renderСhessСlock = () => <>
        <p id={Styles.text}>Внимание, в этом году мы бы хотели прописать, что использование шахматных часов, обязательно! Если оба игрока не хотят их использовать или не имеют этих часов ни в физической форме, ни в виде приложения, а также не смогли их у кого-нибудь одолжить, то заставить вас мы не можем… но при этом организаторы и судьи снимают с себя ответственность в разрешении вопроса, как вам считать результаты игры, закончившейся по времени на втором ходу (или на любом другом, если игра не доиграна).</p>
        <p id={Styles.text}>Ответственность за правильное использование часов лежит на обоих игроках.</p>
        <p id={Styles.text}>Положение шахматных часов на столе не может быть изменено без согласия обоих игроков.</p>
        <p id={Styles.text}>Если один из игроков опоздал к началу партии, то время опоздания вычитается из доступного ему игрового времени.</p>
        <p id={Styles.text}>Если у одного из игроков кончилось время, то он не может делать ничего кроме спас-бросков, бросков варды, удаления потерь и других обязательных действий, без которых игра не может продолжиться. Если время игрока закончилось в процессе выполнения атаки, то он может довести до конца это действие.</p>
        <p id={Styles.text}>Шахматные часы активируются сразу после первого роллофа. С этого момента часы нельзя ставить на паузу до окончания партии. Даже если у вас возник спор по правилам и вам потребовалось вызвать судью, должно продолжать убывать время инициатора спора. Из этого правила есть два исключения: судья имеет право поставить часы на паузу; можно ставить часы на паузу, когда игрок, у которого уже кончилось время, выполняет обязательное действие.</p>
        <p id={Styles.text}>Если игроки начали партию без часов, однако по итогам первого раунда один из них хочет их использовать, то далее игра проходит с контролем времени. В этом случае игроки начинают второй раунд с равным запасом времени (например, если к этому моменту до конца тура осталось 120 минут, то каждый игрок получает 60 минут игрового времени).</p>
    </>

    // const renderСhessСlock = () => <>
    //     <p id={Styles.text}>Если хотя бы один из игроков хочет играть с контролем времени, то игра проходит с шахматными часами (инициатор обязан предоставить устройство подсчета). Согласие второго игрока при этом не требуется.</p>
    //     <p id={Styles.text}>Ответственность за правильное использование часов лежит на обоих игроках.</p>
    //     <p id={Styles.text}>Положение шахматных часов на столе не может быть изменено без согласия обоих игроков.</p>
    //     <p id={Styles.text}>Если один из игроков опоздал к началу партии, то время опоздания вычитается из доступного ему игрового времени.</p>
    //     <p id={Styles.text}>Если у одного из игроков кончилось время, то он не может делать ничего кроме спас-бросков, бросков варды и  удаления потерь. Если время игрока закончилось в процессе выполнения атаки, то он может довести до конца это действие.</p>
    //     <p id={Styles.text}>Обратите внимание, что с того момента, как у игрока закончилось время, он больше не может выполнять боевые тактики, однако он все еще может получать очки за контроль точек.</p>
    //     <p id={Styles.text}>Шахматные часы активируются сразу после первого роллофа. С этого момента часы нельзя ставить на паузу до окончания партии. Даже если у вас возник спор по правилам и вам потребовалось вызвать судью, должно продолжать идти время инициатора спора. Из этого правила есть два исключения: судья имеет право поставить часы на паузу; можно поставить часы на паузу, когда игрок, у которого уже кончилось время, выполняет обязательное действие.</p>
    //     <p id={Styles.text}>Если игроки начали партию без часов, однако по итогам первого раунда один из них хочет их использовать, то далее игра проходит с контролем времени. В этом случае игроки начинают второй раунд с равным запасом времени (например, если к этому моменту до конца тура осталось 120 минут, то каждый игрок получает 60 минут игрового времени).</p>
    //     <p id={Styles.text}></p>
    // </>

    const renderYellowCards = () => <>
        <p id={Styles.text}>Если во время игры вы столкнулись с ситуацией, когда противник специально (преднамеренно, открыто, с очевидным умыслом) нарушает правила, будь то искажение собственного ростера или некорректно-выгодное прочтение варскроллов, некорректные измерения дистанций или что-то подобное, а также если ваш оппонент ведет себя неадекватно или открыто грубо, сразу обратитесь к организаторам.</p>
        <p id={Styles.text}>В зависимости от ситуации, виновному будет вынесено предупреждение вплоть до отстранения от текущего турнира, а, может быть, и от наших турниров в дальнейшем.</p>
        <p id={Styles.text}>И, чтобы не заканчивать пак наших правил на совсем уж тревожной ноте, повторим – пункт вводится исключительно в целях превентивной защиты игроков. А сами организаторы придерживаются незыблемого известного принципа: все должно быть честно, а игры обязаны проходить в исключительно дружеской и доброжелательной обстановке, как завещали изобретатели пива и создатели игровой системы Age of Sigmar!</p>
    </>

    const renderSpeed = () => <>
        <p id={Styles.text}>Помните: быстрая игра – задача обоих игроков. Постарайтесь не отвлекаться на мелочи и неигровые вопросы, договаривайтесь в спорных ситуациях (помните о Самом Главном Правиле GW). Заранее выучите свою армию: варскроллы, заклинания, артефакты, тактики и командные способности, чтобы не тратить драгоценные минуты на листание бумажек и копание в приложении.</p>
        <p id={Styles.text}>Если игра все же идет медленно, и вы видите, что не успеваете совершить задуманное в срок, обращайте внимание только на ключевые моменты, влияющие на результат партии, не разменивайтесь на мелочи (вроде «нет, вот этих вне точки я тебе добью из принципа»).</p>
        <p id={Styles.text}>У всех игроков существует разное отношение к раздельному метанию кубиков. Поэтому на турнире организаторы настоятельно рекомендуют бросать все дайсы максимально сразу, без поштучного откидывания. Постарайтесь ограничить себя в телефонных разговорах и переписках, на длительность хода влияют даже такие «мелочи». Если ваш соперник «упустил ход времени», не стесняйтесь вежливо напоминать ему действовать быстрее и не затягивать игру. Пожалуйста, не обижайтесь сами, если об этом попросят вас</p>
        <p id={Styles.text}>Во время игры можно сдаваться. Если один из игроков решил капитулировать на милость победителя до окончания срока партии, он может об этом заявить. В этом случае игроки заполняют формы отчетов в приложении.</p>
        <p id={Styles.text}>Обязательно отсылайте данные в приложение <b>сразу после проведения партии.</b></p>
        <p id={Styles.text}>На это у вас будет 5 (пять) минут после окончания официального времени игры, после чего бот по таймеру заблокирует возможность отправки данных.</p>
        <p id={Styles.text}>Если результаты партии не сданы игроками в отведенное время, ОБА участника партии автоматически получают по 0 (ноль) турнирных очков.</p>
        <p id={Styles.text}>Пожалуйста, уважительно отнеситесь к работе организаторов и не доводите до указанных санкций!</p>
        <h3 id={Styles.text}>Что ещё важно</h3>
        <p id={Styles.text}>Находиться за чужим столом, на котором еще идет игра, можно только с согласия обоих игроков данного стола. В случае их согласия вы ответно обязуетесь наблюдать за партией молча, без советов, подсказок, критики, стонов и всхлипываний!</p>
        <p id={Styles.text}>Чужие миниатюры можно трогать или брать в руки только с разрешения владельца. Прикасаться к чужим моделям без присутствия за столом хозяина армии – запрещено. Этот же пункт касается и прочих околоигровых вещей: стаканов для кубиков, самих кубиков, рулеток и прочих измерительных устройств, карточек и так далее.</p>
        <br/>
        <p id={Styles.text}>Сразу после окончания партии обязательно убирайте за собой на игровом столе.</p>
        <p id={Styles.text}>Наличие ваших вещей, оставленных на чужом столе менее чем за 5 минут до начала новой партии (армия на игровом поле или подносе, кубики, рулетки, варскролы и ростеры, стаканы и бутылки, книги и прочее) ведет к применению серьезного штрафа в турнирных очках.</p>
        <p id={Styles.text}>Степень пренебрежения чистотой стола перед следующими игроками на нем (а также любые спорные ситуации) и правомерность штрафа выясняются в присутствии судьи.</p>
    </>

    return <div id='column' className='Chapter'>
        {index === 1
            ? renderСhessСlock()
            : index === 2
                ? renderSpeed()
                : renderYellowCards()
        }
    </div>
}

export default AppendixRules