import React from 'react'
import {useNavigate} from 'react-router-dom'
import Constants from '../Constants'
import {ToastContainer, toast} from 'react-toastify'
import 'react-toastify/dist/ReactToastify.css'

import find from 'lodash/find'

import Styles from './styles/TournamentRules.module.css'

const TournamentRules = () => {
    const navigate = useNavigate()

    const handleClickBattleplan = (battleplan) => () => {
        navigate('/battleplan', {state: {title:battleplan.title, battleplan}})
    }

    const handlleClickOrgLink = () => {
        navigator.clipboard.writeText('vk.com/icehammer_aos_tournament')
        toast.success('Ссылка на соц сети организаторов скопирована', Constants.toastParams)
    }

    const handlleClickPhone = () => {
        navigator.clipboard.writeText('+7 913 899 8162')
        toast.success('Телефон скопирован', Constants.toastParams)
    }

    const handlleClickMail = () => {
        navigator.clipboard.writeText('IceHammerAoS@gmail.com')
        toast.success('Почта скопирована', Constants.toastParams)
    }

    const handleClickAppendix = (index, title) => () => {
        navigate('/appendixRules', {state: {title, index}})
    }

    const renderBattleplan = (battleplan) =>
        <button key={battleplan?.id} id={Styles.battleplan} onClick={handleClickBattleplan(battleplan)}>{battleplan?.title}</button>

    return <div id='column' className='Chapter'>
        <p id={Styles.text}>Турнир проводится по системе «Warhammer Age of Sigmar Pitched Battles» 7-8 ноября 2026.</p>
        <p id={Styles.text}><b>Место проведения турнира:</b> г. Новосибирск, Центр культуры и отдыха «Победа», ул. Ленина, дом 7, (метро «Площадь Ленина»).</p>
        <br/>
        <p id={Styles.text}>Размер армий 2 000 pts</p>
        <p id={Styles.text}>Размер столов 60 х 44</p>
        <p id={Styles.text}>Продолжительность игры – 3 часа</p>
        <p id={Styles.text}>Количество игр – 5</p>
        <p id={Styles.text}>Взнос на турнир составит <b>4 000 рублей</b></p>
        <br/>
        <p id={Styles.text}>Подтверждением регистрации является оплата турнирного взноса (4 000) переводом на номер <p id={Styles.link} onClick={handlleClickPhone}>+79138998162</p> (Сбер, без комментов, получатель - Владимир У.). Чек вкладываем в письмо с темой "Айс 26 взнос фамилия_игрока", отправляем на адрес <p id={Styles.link} onClick={handlleClickMail}>IceHammerAoS@gmail.com</p>, готово - вы великолепны!</p>
        <p id={Styles.text}><b>Подача листа:</b> Лист загружается в данном приложение</p>
        <p id={Styles.text}>Здесь вы не только сможете пройти регистрацию, но и подать ростер и убедиться в его валидации, впоследствии ознакомиться с ростерами всех участников и их полным списком, а во время турнира оперативно получать паринги, номера игровых столов, карточки с условиями миссий и сдавать результаты игр.</p>
        <p id={Styles.text}>Резервные контакты для связи с оргкомитетом: <p id={Styles.link} onClick={handlleClickOrgLink}>VK Ice Hammer</p></p>
        <br/>
        <p id={Styles.text}><b>Список сценариев на турнир:</b></p>
        {renderBattleplan(find(Constants.tournamentBattleplans, ['title', 'Bloodstained Coasts']))}
        {renderBattleplan(find(Constants.tournamentBattleplans, ['title', 'Avalanche of Ash']))}
        {renderBattleplan(find(Constants.tournamentBattleplans, ['title', "What's Yours is Ours"]))}
        {renderBattleplan(find(Constants.tournamentBattleplans, ['title', 'Treacherous Ground']))}
        {renderBattleplan(find(Constants.tournamentBattleplans, ['title', 'Escape From the Coast']))}
        {renderBattleplan(find(Constants.tournamentBattleplans, ['title', 'Power of the Realms']))}
        <br/>
        <p id={Styles.text}>Обратите внимание, что в списке шесть миссий – это сделано для того, чтобы сценарий на последнюю игру турнира тоже определялся не автоматически, а с элементом неожиданности.</p>
        <p id={Styles.text}>Каждый из сценариев будет сыгран один раз за турнир; какой именно сценарий будет сыгран в туре, определяется броском кубика перед его началом сразу после рассылки парингов в ТГ-бот</p>
        <p id={Styles.text}>Для участия в турнире вам необходима армия из моделей, соответствующих включенным в ростер варскроллам, установленных на подставки необходимого размера, а также покрашенная и с обязательно оформленными базами под стандарт «battle ready» или лучше.</p>
        <p id={Styles.text}>Кроме армии, вам необходимы кубики, рулетка или линейка для измерения расстояний и правила на вашу армию. Если вы используете электронные носители для правил вашей армии, убедитесь, что они заряжены и готовы к длительному использованию.</p>
        <p id={Styles.text}>Ваша армия должна быть набрана по актуальным на данный момент правилам (текущий сезон GHB и Battle Profiles). Если правила вашей армии позволяют в течение игры призывать дополнительные модели, заменять одни модели на другие или выполнять прочие схожие операции, то для их реализации вы должны иметь соответствующие модели (если собираетесь их использовать).</p>
        <p id={Styles.text}>На всем протяжении турнира вы используете один и тот же ростер без внесения каких-либо изменений.</p>
        <p id={Styles.text}>Заморозка правил (выходящие книги, FAQ и так далее): <b>30 октября 2026 включительно.</b> К турниру допускаются все армии, на которые будут обновления в официальном приложении к этому времени.</p>
        <p id={Styles.text}><b>ФОТОВАЛИДАЦИЯ:</b> перед турниром вы должны прислать организаторам (через специальную функцию в приложении бота) разборчивое фото вашей армии, где видно, как сами модели, так и уровень покраса. Особое внимание при подаче фотоматериала следуем уделить конверсиям и альтернативным моделям, допуском которых будет снова заниматься особая художественная комиссия.</p>
        <p id={Styles.text}>Отсечка по приемке ростеров и фотовалидации 23:59 московского времени 02 ноября 2026 года. Если вы не успеваете докрасить вашу армию к этому сроку, но уверены, что доделаете к самому турниру, свяжитесь с организаторами.</p>
        <br/>
        <p id={Styles.text}><b>ВАЖНО:</b>если вы уже зарегистрировались, отправили взнос-ростер и получили все необходимые подтверждения, но затем по какой-то причине решили пропустить турнир, ПОЖАЛУЙСТА, найдите минуту, свяжитесь с организаторами и расскажите им о своем решении.</p>
        <p id={Styles.text}>По прибытию на мероприятие вы обязаны отметить свое наличие у организаторов.</p>
        <br/>
        <h3 id={Styles.text}>Расписание турнира</h3>
        <h2>7 ноября</h2>
        <table>
        <tr>
            <th>Время</th>
            <th>Событие</th>
        </tr>
        <tr>
            <td>9:00 - 9:45</td>
            <td>Регистрация</td>
        </tr>
        <tr>
            <td>9:45 - 10:00</td>
            <td>Вступительное слово</td>
        </tr>
        <tr>
            <td>10:00 - 13:00</td>
            <td>1 тур</td>
        </tr>
        <tr>
            <td>13:00 - 14:00</td>
            <td>Обед</td>
        </tr>
        <tr>
            <td>14:00 - 17:00</td>
            <td>2 тур</td>
        </tr>
        <tr>
            <td>17:30 - 20:30</td>
            <td>3 тур</td>
        </tr>
        </table>
        <h2>8 ноября</h2>
        <table>
            <tr>
                <th>Время</th>
                <th>Событие</th>
            </tr>
            <tr>
                <td>10:00 - 13:00</td>
                <td>4 тур</td>
            </tr>
            <tr>
                <td>13:00 - 14:00</td>
                <td>Конкурс покраса</td>
            </tr>
            <tr>
                <td>14:00 - 17:00</td>
                <td>5 тур</td>
            </tr>
            <tr>
                <td>17:30</td>
                <td>Награждение</td>
            </tr>
        </table>
        <h3 id={Styles.text}>Игры и результаты</h3>
        <p id={Styles.text}>Первую битву вы проведете с оппонентом, случайным образом определенным организаторами.</p>
        <p id={Styles.text}>В последующих партиях противники будут определяться случайным образом, исходя из общего числа побед.</p>
        <p id={Styles.text}>В первый игровой день, в первых двух играх, мы приложим все усилия, чтобы игроки из одного города не играли друг с другом.</p>
        <br/>
        <p id={Styles.text}>Элементы ландшафта (террейн) на столах будут заранее обеспечены организаторами. Просьба не переставлять элементы между столами.</p>
        <p id={Styles.text}><b>Обращаем внимание: </b>Террейн перед каждой игрой необходимо расставить в соответствии со схемой миссии. Кроме этого, советуем вам сразу обсудить с оппонентом, какой террейн к какому типу относится, какие части «импас», какие «обстакл» и так далее.</p>
        <p id={Styles.text}>После партии внесите свои очки и очки оппонента, заработанные в миссии, в специальную форму приложения.</p>
        <br/>
        <p id={Styles.text}><b>Подсчет очков.</b></p>
        <p id={Styles.text}>В данной таблице приведено количество ТУРНИРНЫХ очков, которые будут получать игроки по результатам игр. Эти ТУРНИРНЫЕ очки будут считаться автоматически, после заполнения вами очков, заработанных за игру.</p>
        <p id={Styles.text}></p>
        <table>
            <tr>
                <th>Разница в победных очках</th>
                <th>Турнирные очки победителя</th>
                <th>Турнирные очки проигравшего</th>
            </tr>
            <tr><td>0 и поровну тактик</td><td>10</td><td>10</td></tr>
            <tr><td>0 + больше тактик</td><td>11</td><td>9</td></tr>
            <tr><td>1-5</td><td>12</td><td>8</td></tr>
            <tr><td>6-10</td><td>13</td><td>7</td></tr>
            <tr><td>11-15</td><td>14</td><td>6</td></tr>
            <tr><td>16-20</td><td>15</td><td>5</td></tr>
            <tr><td>21-25</td><td>16</td><td>4</td></tr>
            <tr><td>26-30</td><td>17</td><td>3</td></tr>
            <tr><td>31-35</td><td>18</td><td>2</td></tr>
            <tr><td>36-40</td><td>19</td><td>1</td></tr>
            <tr><td>41+</td><td>20</td><td>0</td></tr>
        </table>
        <p id={Styles.text}>Победителем турнира станет участник, одержавший больше всего побед и ничьих.</p>
        <p id={Styles.text}>В случае равного количества побед и ничьих среди нескольких игроков первым тай-брейкером станут Итоговые Очки (формула их получения ниже), вторым тай-брейкером является сумма Турнирных Очков игрока.</p>
        <p id={Styles.text}>Итоговые Очки определяются по формуле:</p>
        <p id={Styles.text}><b>Итоговые очки = ТО + (AOP × AOW) / 10</b></p>
        <p id={Styles.text}>Где:</p>
        <p id={Styles.text}><b>ТО</b> — сумма турнирных очков, набранных игроком.</p>
        <p id={Styles.text}><b>AOP</b> — среднее количество турнирных очков его соперников.</p>
        <p id={Styles.text}><b>AOW</b> — среднее количество побед его соперников.</p>
        <p id={Styles.text}>Данная формула уже использовалась нами в прошлом году, нам она понравилась, и мы решили продолжить эксперимент. Надеемся, что это изменение сделает турнирную борьбу еще более интересной и справедливой!</p>
        <br/>
        <p id={Styles.text}>Также на турнире будут выбраны Лучшие Генералы каждого Грандальянса, Лучший Противник и Лучшая Армия.</p>
        <p id={Styles.text}>После турнира в специальном разделе нашего ТГ-бота вам будет предложено проголосовать за одного из пяти противников, с которым вам было максимально комфортно играть; также в обед второго дня в нем вы сможете отметить номера 3 (трех) армий (не обязательно из числа турнирных соперников), которые, по вашему мнению, наиболее отвечают характеристике «вау, какая красивая, изумительная и просто отличная армия, срочно в топ-3 из представленных на турнире!».</p>
        <br/>
        <h3 id={Styles.text}>Дополнительные правила</h3>
        <button id={Styles.button} onClick={handleClickAppendix(1, 'Правила использования шахматных часов')}>Правила использования шахматных часов</button>
        <button id={Styles.button} onClick={handleClickAppendix(2, 'Этика скорости')}>Этика скорости</button>
        <button id={Styles.button} onClick={handleClickAppendix(3, 'Нарушения и наказания')}>Нарушения и наказания</button>
        <h2 id={Styles.text}>С нетерпением ждём вас на турнире 7-8 ноября!</h2>
        <ToastContainer />
    </div>
}

export default TournamentRules
